In [6]:
import numpy as np
import pandas as pd

df_2 = pd.DataFrame(np.random.rand(3,2))
df_2

          0         1
0  0.879332  0.602572
1  0.259054  0.045185
2  0.795812  0.661733

In [7]:
    df_2 = pd.DataFrame(np.random.rand(3,2),columns=['col1','col2'],index =['a','b','c'])
df_2

       col1      col2
a  0.031328  0.546465
b  0.885889  0.051983
c  0.955413  0.850201

In [13]:
# Dict {key:value}
plate_code ={'I':'3', "A ": "4", 'C' : '5' }
population_number ={'I':1000,
                    'A':500,
                    'C': 100}

cities =pd.DataFrame({'plates': plate_code,'population':population_number})
cities

   plates  population
I       3      1000.0
A       4         NaN
C       5       100.0
A     NaN       500.0

In [14]:
type(cities.index)

pandas.core.indexes.base.Index

In [17]:
cities.index

Index(['I', 'A ', 'C', 'A'], dtype='object')

In [19]:
index_ =pd.Index([1,2,3])
index_

Int64Index([1, 2, 3], dtype='int64')

In [20]:
index_[0]

1

In [21]:
# Index does not support mutable operations
index_[1]=3

TypeError: Index does not support mutable operations

In [22]:
index_1=pd.Index([1,2,3,4,5])
index_2=pd.Index([2,4,6])

In [23]:
# kesisim kumesi
index_1&index_2

Int64Index([2, 4], dtype='int64')

In [24]:
# birlesim kumesi
index_1|index_2

Int64Index([1, 2, 3, 4, 5, 6], dtype='int64')

In [25]:
index_1^index_2

Int64Index([1, 3, 5, 6], dtype='int64')

In [26]:
arr =np.array([[2,3,4],[4,5,0]])
arr

array([[2, 3, 4],
       [4, 5, 0]])

In [27]:
arr[1,2]

0

In [29]:
df_2

       col1      col2
a  0.031328  0.546465
b  0.885889  0.051983
c  0.955413  0.850201

In [ ]:
## tis is wring   df_2[0:0,0:1]

## loc  ve iloc

In [35]:
pd.DataFrame.loc?

In [36]:
df_2.loc['a']

col1    0.031328
col2    0.546465
Name: a, dtype: float64

In [38]:
df_2.loc['a','col1']

0.03132794220469337

In [43]:
pd.DataFrame.iloc?

In [45]:
df_2.iloc[1]

col1    0.885889
col2    0.051983
Name: b, dtype: float64

In [47]:
df_2.iloc[1:3,0:1]

       col1
b  0.885889
c  0.955413

# Temel istatistikler

In [48]:
df_2.describe().T

,count,mean,std,min,25%,50%,75%,max
col1,3.0,0.624210,0.514626,0.031328,0.458608,0.885889,0.920651,0.955413
col2,3.0,0.482883,0.402890,0.051983,0.299224,0.546465,0.698333,0.850201

In [51]:

df_2['col1'].mean()

0.8858888559336745

# Eksik veriler
1. Nan
2. Null
3. None

In [52]:
var =np.array([1,2,None,5,2])
var

array([1, 2, None, 5, 2], dtype=object)

In [53]:
type(var)

numpy.ndarray

In [54]:
type(var[2])

NoneType

In [55]:
# icinde None olan bir vdri serinde matematik islemleri yapilir mi
var.sum()

TypeError: unsupported operand type(s) for +: 'int' and 'NoneType'

In [39]:
var1 =np.array(1,2,np.nan,3)
var1.sum()

TypeError: array() takes from 1 to 2 positional arguments but 4 were given

In [59]:
dt =pd.Series([1,np.nan,'merhaba',None])

In [60]:
dt.isnull()

0    False
1     True
2    False
3     True
dtype: bool

In [61]:
dt[dt.isnull()]

1     NaN
3    None
dtype: object

In [62]:
dt.notnull()

0     True
1    False
2     True
3    False
dtype: bool

In [63]:
dt[dt.notnull()]

0          1
2    merhaba
dtype: object

In [65]:
dt.dropna()

0          1
2    merhaba
dtype: object

In [66]:
dt

0          1
1        NaN
2    merhaba
3       None
dtype: object

In [68]:
data2=dt.dropna()

In [ ]:
dt.dropna()

In [70]:
df3=pd.DataFrame([[1,np.nan,2],[3,4,5],[np.nan,4,6]])
df3

     0    1  2
0  1.0  NaN  2
1  3.0  4.0  5
2  NaN  4.0  6

In [71]:
df3.dropna()

     0    1  2
1  3.0  4.0  5

In [73]:
df3.dropna(axis=1)

   2
0  2
1  5
2  6

In [74]:
df3.dropna(axis=0)

     0    1  2
1  3.0  4.0  5

## NaN i doldurma

In [75]:
df3.iloc[0,1]=4
df3

     0    1  2
0  1.0  4.0  2
1  3.0  4.0  5
2  NaN  4.0  6

In [77]:
df3.fillna(0)

     0    1  2
0  1.0  4.0  2
1  3.0  4.0  5
2  0.0  4.0  6

In [78]:
df3.fillna(method = 'ffill')

     0    1  2
0  1.0  4.0  2
1  3.0  4.0  5
2  3.0  4.0  6

In [ ]:
df3.fillna(method='')

In [79]:
df3.fillna(method = 'ffill',axis =1)

     0    1    2
0  1.0  4.0  2.0
1  3.0  4.0  5.0
2  NaN  4.0  6.0

In [80]:
df3.fillna(method = 'ffill',axis =0)

     0    1  2
0  1.0  4.0  2
1  3.0  4.0  5
2  3.0  4.0  6

## groupby

In [2]:
import numpy as np
import pandas as pd
df =pd.read_csv('C:/Users/aozde/OneDrive/Documents/DataMining/CanerErdin/employees.csv')
df

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
0,Douglas,Male,8/6/1993,12:42 PM,97308,6.945,True,Marketing
1,Thomas,Male,3/31/1996,6:53 AM,61933,4.170,True,NaN
2,Maria,Female,4/23/1993,11:17 AM,130590,11.858,False,Finance
3,Jerry,Male,3/4/2005,1:00 PM,138705,9.340,True,Finance
4,Larry,Male,1/24/1998,4:47 PM,101004,1.389,True,Client Services
...,...,...,...,...,...,...,...,...
995,Henry,NaN,11/23/2014,6:09 AM,132483,16.655,False,Distribution
996,Phillip,Male,1/31/1984,6:30 AM,42392,19.675,False,Finance
997,Russell,Male,5/20/2013,12:39 PM,96914,1.421,False,Product
998,Larry,Male,4/20/2013,4:45 PM,60500,11.985,False,Business Development
999,Albert,Male,5/15/2012,6:24 PM,129949,10.169,True,Sales

In [82]:
df.head()

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
0,Douglas,Male,8/6/1993,12:42 PM,97308,6.945,True,Marketing
1,Thomas,Male,3/31/1996,6:53 AM,61933,4.170,True,NaN
2,Maria,Female,4/23/1993,11:17 AM,130590,11.858,False,Finance
3,Jerry,Male,3/4/2005,1:00 PM,138705,9.340,True,Finance
4,Larry,Male,1/24/1998,4:47 PM,101004,1.389,True,Client Services

In [83]:
df.groupby('Team').sum()

                       Salary   Bonus %
Team
Business Development  9278498  1067.810
Client Services       9351789  1112.481
Distribution          7965042   865.408
Engineering           8672766   962.595
Finance               9406387  1039.061
Human Resources       8275952   909.443
Legal                 7858718   908.409
Marketing             8862688  1014.638
Product               8423223   930.191
Sales                 8664303   950.990

In [84]:
df.groupby('Team')['Salary'].sum()

Team
Business Development    9278498
Client Services         9351789
Distribution            7965042
Engineering             8672766
Finance                 9406387
Human Resources         8275952
Legal                   7858718
Marketing               8862688
Product                 8423223
Sales                   8664303
Name: Salary, dtype: int64

In [86]:
df.groupby('Team')['Bonus %'].sum()

Team
Business Development    1067.810
Client Services         1112.481
Distribution             865.408
Engineering              962.595
Finance                 1039.061
Human Resources          909.443
Legal                    908.409
Marketing               1014.638
Product                  930.191
Sales                    950.990
Name: Bonus %, dtype: float64

In [ ]:
df.groupby('Team')[[ 'Marketing','Salary']].sum()

# pivotlar
## Cikti almaya baslayacagim yer

In [89]:
birth=pd.read_csv('C:/Users/aozde/OneDrive/Documents/DataMining/CanerErdin/births.csv')
birth

       year  month  day gender  births
0      1969      1  1.0      F    4046
1      1969      1  1.0      M    4440
2      1969      1  2.0      F    4454
3      1969      1  2.0      M    4548
4      1969      1  3.0      F    4548
...     ...    ...  ...    ...     ...
15542  2008     10  NaN      M  183219
15543  2008     11  NaN      F  158939
15544  2008     11  NaN      M  165468
15545  2008     12  NaN      F  173215
15546  2008     12  NaN      M  181235

[15547 rows x 5 columns]

In [90]:
birth.head()

   year  month  day gender  births
0  1969      1  1.0      F    4046
1  1969      1  1.0      M    4440
2  1969      1  2.0      F    4454
3  1969      1  2.0      M    4548
4  1969      1  3.0      F    4548

In [91]:
birth.groupby(by='gender').sum()

            year  month       day    births
gender
F       15388995  50648  134012.0  74035823
M       15379100  50655  133727.0  77738555

In [92]:
birth.groupby(by='gender').sum()['births']

gender
F    74035823
M    77738555
Name: births, dtype: int64

In [93]:
birth.groupby(by='gender').mean()['births']

gender
F     9521.067773
M    10003.674559
Name: births, dtype: float64

In [6]:
df.head()

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
0,Douglas,Male,8/6/1993,12:42 PM,97308,6.945,True,Marketing
1,Thomas,Male,3/31/1996,6:53 AM,61933,4.170,True,NaN
2,Maria,Female,4/23/1993,11:17 AM,130590,11.858,False,Finance
3,Jerry,Male,3/4/2005,1:00 PM,138705,9.340,True,Finance
4,Larry,Male,1/24/1998,4:47 PM,101004,1.389,True,Client Services

In [7]:
# tum verileri gor
df['Team']

0                 Marketing
1                       NaN
2                   Finance
3                   Finance
4           Client Services
               ...
995            Distribution
996                 Finance
997                 Product
998    Business Development
999                   Sales
Name: Team, Length: 1000, dtype: object

In [8]:
#above with same
df.Team

0                 Marketing
1                       NaN
2                   Finance
3                   Finance
4           Client Services
               ...
995            Distribution
996                 Finance
997                 Product
998    Business Development
999                   Sales
Name: Team, Length: 1000, dtype: object

In [10]:
df['Team'].isnull().sum()

43

In [11]:
##df['Team'].isnull().count()

1000

In [12]:
# eksik veri sayisi
df.isnull().sum()

First Name            67
Gender               145
Start Date             0
Last Login Time        0
Salary                 0
Bonus %                0
Senior Management     67
Team                  43
dtype: int64

In [13]:
df['Team'].dropna()

0                 Marketing
2                   Finance
3                   Finance
4           Client Services
5                     Legal
               ...
995            Distribution
996                 Finance
997                 Product
998    Business Development
999                   Sales
Name: Team, Length: 957, dtype: object

## 5_1 Pandas'ta onemli fonksiyonlar

In [15]:
df.head()

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
0,Douglas,Male,8/6/1993,12:42 PM,97308,6.945,True,Marketing
1,Thomas,Male,3/31/1996,6:53 AM,61933,4.170,True,NaN
2,Maria,Female,4/23/1993,11:17 AM,130590,11.858,False,Finance
3,Jerry,Male,3/4/2005,1:00 PM,138705,9.340,True,Finance
4,Larry,Male,1/24/1998,4:47 PM,101004,1.389,True,Client Services

In [16]:
row_number,column_number =df.shape

In [17]:
row_number

1000

In [18]:
column_number

8

In [19]:
df.dropna(thresh=6).isnull().sum

<bound method DataFrame.sum of      First Name  Gender  Start Date  Last Login Time  Salary  Bonus %  \
0         False   False       False            False   False    False
1         False   False       False            False   False    False
2         False   False       False            False   False    False
3         False   False       False            False   False    False
4         False   False       False            False   False    False
..          ...     ...         ...              ...     ...      ...
995       False    True       False            False   False    False
996       False   False       False            False   False    False
997       False   False       False            False   False    False
998       False   False       False            False   False    False
999       False   False       False            False   False    False

     Senior Management   Team
0                False  False
1                False   True
2                False  False
3                False  False
4                False  False
..                 ...    ...
995              False  False
996              False  False
997              False  False
998              False  False
999              False  False

[985 rows x 8 columns]>


### to_numpy
* Bir dataframe tamamen ayni sayisal tipten olusuyorsa  onu  bu metodla numpya cevirebiliriz.

In [21]:
df_2 = pd.DataFrame(np.random.rand(3,2),columns=['col1','col2'],index =['a','b','c'])
df_2

       col1      col2
a  0.608259  0.589530
b  0.844927  0.022965
c  0.281447  0.778200

In [23]:
# numpy arraye cevirecegim
df_2.to_numpy()

array([[0.60825913, 0.58952964],
       [0.84492654, 0.02296542],
       [0.28144685, 0.77820013]])

In [25]:
df.head()

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
0,Douglas,Male,8/6/1993,12:42 PM,97308,6.945,True,Marketing
1,Thomas,Male,3/31/1996,6:53 AM,61933,4.170,True,NaN
2,Maria,Female,4/23/1993,11:17 AM,130590,11.858,False,Finance
3,Jerry,Male,3/4/2005,1:00 PM,138705,9.340,True,Finance
4,Larry,Male,1/24/1998,4:47 PM,101004,1.389,True,Client Services

In [26]:
## Serilerde calisir .Bir sutun veririz
df.Team.value_counts()

Client Services         106
Finance                 102
Business Development    101
Marketing                98
Product                  95
Sales                    94
Engineering              92
Human Resources          91
Distribution             90
Legal                    88
Name: Team, dtype: int64

In [30]:
df.sort_values(by ='Salary',ascending =False)

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
644,Katherine,Female,8/13/1996,12:21 AM,149908,18.912,False,Finance
429,Rose,Female,5/28/2015,8:40 AM,149903,5.630,False,Human Resources
828,Cynthia,Female,7/12/2006,8:55 AM,149684,7.864,False,Product
186,NaN,Female,2/23/2005,9:50 PM,149654,1.825,NaN,Sales
160,Kathy,Female,3/18/2000,7:26 PM,149563,16.991,True,Finance
...,...,...,...,...,...,...,...,...
650,Cynthia,Female,7/5/1986,1:24 AM,35381,11.749,False,Finance
63,Matthew,Male,1/2/2013,10:33 PM,35203,18.040,False,Human Resources
82,Steven,Male,3/30/1980,9:20 PM,35095,8.379,True,Client Services
238,Kevin,Male,3/25/1982,7:31 AM,35061,5.128,False,Legal
576,Michael,Male,7/30/1993,5:35 PM,35013,14.879,False,Product

In [31]:
df.dtypes

First Name            object
Gender                object
Start Date            object
Last Login Time       object
Salary                 int64
Bonus %              float64
Senior Management     object
Team                  object
dtype: object

In [32]:
df.sort_values(by ='Salary',ascending =False,inplace=True)

In [33]:
df.head()

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
644,Katherine,Female,8/13/1996,12:21 AM,149908,18.912,False,Finance
429,Rose,Female,5/28/2015,8:40 AM,149903,5.630,False,Human Resources
828,Cynthia,Female,7/12/2006,8:55 AM,149684,7.864,False,Product
186,NaN,Female,2/23/2005,9:50 PM,149654,1.825,NaN,Sales
160,Kathy,Female,3/18/2000,7:26 PM,149563,16.991,True,Finance

In [35]:
df.reset_index(drop=True,inplace=True)
df.head()

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
0,Katherine,Female,8/13/1996,12:21 AM,149908,18.912,False,Finance
1,Rose,Female,5/28/2015,8:40 AM,149903,5.630,False,Human Resources
2,Cynthia,Female,7/12/2006,8:55 AM,149684,7.864,False,Product
3,NaN,Female,2/23/2005,9:50 PM,149654,1.825,NaN,Sales
4,Kathy,Female,3/18/2000,7:26 PM,149563,16.991,True,Finance

In [36]:
df.to_csv('siralanmis.csv')

In [ ]:
pd.read_

## Apply